code-review/NRB_3471_3546/База_Было/Documents/ДанныеИзDiasoft.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДанныеИзDiasoft</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДанныхИзDiasoft</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыДанныхИзDiasoft.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДанныхИзDiasoft</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ДанныеИзDiasoft/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидДанных) Тогда
			Объект.ВидДанных = Перечисления.ВидыДанныхИзDiasoft.ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			Объект.КонецПериода = КонецМесяца(НачалоМесяца(ТекущаяДатаСеанса()) - 1);
			Объект.НачалоПериода = НачалоГода(Объект.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовый = ТекущийОбъект.Ссылка <> Объект.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоНовый Тогда
		УстановитьОтбор();
		ЭтоНовый = Ложь;
		УстановитьДоступностьЭлементов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	Объект.НачалоПериода = НачалоМесяца(Объект.КонецПериода);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторСообщенияОткрытие(Элемент, СтандартнаяОбработка)
	КлючЗаписи = КлючЗаписиЖурналаВходящихСообщенийKafka();
	ПараметрыФормыЗаписи = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.ЖурналВходящихСообщенийKafka.ФормаЗаписи", ПараметрыФормыЗаписи);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	Элементы.СписокДанных.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДанных, "ДокументЗагрузки", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КлючЗаписиЖурналаВходящихСообщенийKafka()
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToDiasRequestData1655;
	ЗначенияКлюча = Новый Структура("ВнешнийИсточник, Идентификатор", ВнешнийИсточник, Объект.ИдентификаторСообщения);
	КлючЗаписи = РегистрыСведений.ЖурналВходящихСообщенийKafka.СоздатьКлючЗаписи(ЗначенияКлюча);
	
	Возврат КлючЗаписи;
КонецФункции

#КонецОбласти
